Revit 2027 API
SharedParameterElement.Create Method
 Creates a new shared parameter element in the document representing the parameter stored in the input ExternalDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static SharedParameterElement Create(
	Document document,
	ExternalDefinition sharedParameterDefinition
)
Public Shared Function Create (
	document As Document,
	sharedParameterDefinition As ExternalDefinition
) As SharedParameterElement
public:
static SharedParameterElement^ Create(
	Document^ document,
	ExternalDefinition^ sharedParameterDefinition
)
static member Create :
        document : Document *
        sharedParameterDefinition : ExternalDefinition -> SharedParameterElement
Parameters
document Document
 The document.
sharedParameterDefinition ExternalDefinition
 Shared parameter definition.
Return Value
SharedParameterElement
 The newly created shared parameter instance.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  A shared parameter with the assigned GUID is already loaded into the document.
See Also
Reference
SharedParameterElement Class
Autodesk.Revit.DB Namespace